# Tidy Data

Just to recap what we saw before:

Hadley Wickham proposed the term **TIDY DATA**.

>A huge amount of effort is spent cleaning data to get it ready for analysis, but there
has been little research on how to make data cleaning as easy and effective as possible.
This paper tackles a small, but important, component of data cleaning: data tidying.
Tidy datasets are easy to manipulate, model and visualise, and have a specific structure:
each variable is a column, each observation is a row, and each type of observational unit
is a table. This framework makes it easy to tidy messy datasets because only a small
set of tools are needed to deal with a wide range of un-tidy datasets. This structure
also makes it easier to develop tidy tools for data analysis, tools that both input and
output tidy datasets. The advantages of a consistent data structure and matching tools
are demonstrated with a case study free from mundane data manipulation chores. -- Hadley Wickham https://vita.had.co.nz/papers/tidy-data.pdf

Data can be represented and stored in many ways. With different ways of storing/organizing, the effectiveness in doing operations may vary greatly.

**Wickham** suggests us to store data in a way that is call **tidy data**. The rules for data to be in this from are:

>1. Each variable must have it's own column.
2. Each observation must have its own row.
3. Each value must have its own cell.

![tidy data](assets/tidy1.png)
Reference: Image from the online book "R for Data Science" by Hadley Wichham & Garrett Grolemund https://r4ds.had.co.nz/tidy-data.html

**Many functions** come with pandas were created to work with data in the tidy form very well. 

Ex

In [2]:
import pandas as pd

In [8]:
# Create a dataframe to be used next

earthquake = pd.DataFrame({"Country":["Thailand","Japan","Japan","USA","USA","Singapore"],"Magnitude":[5.0,7.8,8.1,6.4,3.1,3.1]})
earthquake

     Country  Magnitude
0   Thailand        5.0
1      Japan        7.8
2      Japan        8.1
3        USA        6.4
4        USA        3.1
5  Singapore        3.1

In [9]:
# Calling unique function
x = earthquake["Country"].unique()
x

array(['Thailand', 'Japan', 'USA', 'Singapore'], dtype=object)

In [10]:
# If we want to know how many unique values
len(x)

4

In [11]:
# Calling mean (average) function
earthquake["Magnitude"].mean()

5.583333333333333

In [12]:
# Finding the max value
earthquake["Magnitude"].max()

8.1

In [13]:
# Finding the min value
earthquake["Magnitude"].min()

3.1

In [26]:
# Finding all countries that has the min value
min_val = earthquake["Magnitude"].min()

# Use a list of boolean values to select only certain rows
min_val_df = earthquake[ earthquake["Magnitude"]==min_val ]

# Let's take a look
min_val_df

     Country  Magnitude
4        USA        3.1
5  Singapore        3.1

## Performing calculations using values from columns
When we have data in columns, it is also easy to perform calculation on/between the columns.

In [7]:
earthquake["Square"] = earthquake["Magnitude"] * earthquake["Magnitude"]
earthquake

    Country  Magnitude  Square
0  Thailand        5.0   25.00
1     Japan        7.8   60.84
2     Japan        8.1   65.61
3       USA        6.4   40.96
4       USA        3.1    9.61

## Forming Tidy Data

Each column shall be a variable. However, we may encounbter data that each column is not a column. However, the columns hold values.

Let's see the data that may come in real life.

In [18]:
pew = pd.read_csv('./datasets/pew.csv')
pew.head(5)

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116

### WIDE DATA 

The dataframe above has many columns.

**religion** column is a variable. Data points in this column is the religion. We may also notice that this is the only column we can find information about the religion.

We can also notice many columns that look like  **breakout columns** of number of people in each religion. This is known as **wide data**.

Pandas can help us **melt** the columns.
The key parameters are:
* **id_vars** : list/tuple/array that holds variables that will remain
* **value_vars** : columns we want to melt
* **var_name** : value_vars will melt to this new column
* **value_name** : column name that of the value

Ex: If we want to turn a wide data to a long data, ..
![melt](./assets/melt1.png)

![melt](./assets/melt2.png)

In [24]:
# First, let's make a dummy data
students = pd.DataFrame({"Division":["BA","THM"],"<1.50":[2,3],"1.50-1.80":[8,6],"1.80-2.00":[36,12],"2.00-3.25":[870,142],"3.25-3.60":[32,14],"3.60-4.00":[14,4]})

# Let's take a look
students

  Division  <1.50  1.50-1.80  1.80-2.00  2.00-3.25  3.25-3.60  3.60-4.00
0       BA      2          8         36        870         32         14
1      THM      3          6         12        142         14          4

In [25]:
# Melt other columns (keep only Division column the same)
# The columns will be in variable column, the values will be in the value column

students_long = pd.melt(students,"Division")

# Let's take a look
students_long

   Division   variable  value
0        BA      <1.50      2
1       THM      <1.50      3
2        BA  1.50-1.80      8
3       THM  1.50-1.80      6
4        BA  1.80-2.00     36
5       THM  1.80-2.00     12
6        BA  2.00-3.25    870
7       THM  2.00-3.25    142
8        BA  3.25-3.60     32
9       THM  3.25-3.60     14
10       BA  3.60-4.00     14
11      THM  3.60-4.00      4

The column names like "variable" and "value" may not tell about what data they are. 

We can adjust the column names to what we want.

In [27]:
students_long = pd.melt(students,"Division",var_name="category",value_name="count")

# Let's take a look
students_long

   Division   category  count
0        BA      <1.50      2
1       THM      <1.50      3
2        BA  1.50-1.80      8
3       THM  1.50-1.80      6
4        BA  1.80-2.00     36
5       THM  1.80-2.00     12
6        BA  2.00-3.25    870
7       THM  2.00-3.25    142
8        BA  3.25-3.60     32
9       THM  3.25-3.60     14
10       BA  3.60-4.00     14
11      THM  3.60-4.00      4

### Keeping Multiple Columns The Same (don't melt those)

In [28]:
billboard = pd.read_csv('./datasets/billboard.csv')

In [32]:
# There are many rows...and many columns
billboard.shape

(317, 81)

In [31]:
# Let's take a look
print(billboard.iloc[0:5, 0:16])

   year        artist                    track  time date.entered  wk1   wk2  \
0  2000         2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   87  82.0
1  2000       2Ge+her  The Hardest Part Of ...  3:15   2000-09-02   91  87.0
2  2000  3 Doors Down               Kryptonite  3:53   2000-04-08   81  70.0
3  2000  3 Doors Down                    Loser  4:24   2000-10-21   76  76.0
4  2000      504 Boyz            Wobble Wobble  3:35   2000-04-15   57  34.0

    wk3   wk4   wk5   wk6   wk7   wk8   wk9  wk10  wk11
0  72.0  77.0  87.0  94.0  99.0   NaN   NaN   NaN   NaN
1  92.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
2  68.0  67.0  66.0  57.0  54.0  53.0  51.0  51.0  51.0
3  72.0  69.0  67.0  65.0  55.0  59.0  62.0  61.0  61.0
4  25.0  17.0  17.0  31.0  36.0  49.0  53.0  57.0  64.0

In [34]:
# Don't melt: year, artist, track, time, date.entered

billboard_long = pd.melt(billboard, id_vars=['year','artist','track','time','date.entered'],var_name="week",value_name='rating')

# Let's take a look
billboard_long.head()

   year        artist                    track  time date.entered week  rating
0  2000         2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26  wk1    87.0
1  2000       2Ge+her  The Hardest Part Of ...  3:15   2000-09-02  wk1    91.0
2  2000  3 Doors Down               Kryptonite  3:53   2000-04-08  wk1    81.0
3  2000  3 Doors Down                    Loser  4:24   2000-10-21  wk1    76.0
4  2000      504 Boyz            Wobble Wobble  3:35   2000-04-15  wk1    57.0

In [38]:
# A shorter way , using index
billboard_test = pd.melt(billboard, id_vars= billboard.columns[0:5] ,var_name="week",value_name='rating')

# Let's take a look
billboard_test

,year,artist,track,time,date.entered,week,rating
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,wk1,87.0
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,wk1,91.0
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,wk1,81.0
3,2000,3 Doors Down,Loser,4:24,2000-10-21,wk1,76.0
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,wk1,57.0
...,...,...,...,...,...,...,...
24087,2000,Yankee Grey,Another Nine Minutes,3:10,2000-04-29,wk76,NaN
24088,2000,"Yearwood, Trisha",Real Live Woman,3:55,2000-04-01,wk76,NaN
24089,2000,Ying Yang Twins,Whistle While You Tw...,4:19,2000-03-18,wk76,NaN
24090,2000,Zombie Nation,Kernkraft 400,3:30,2000-09-02,wk76,NaN
24091,2000,matchbox twenty,Bent,4:12,2000-04-29,wk76,NaN

In [39]:
# Let's take a look at the buttom part of the dataframe
billboard_long.tail()

,year,artist,track,time,date.entered,week,rating
24087,2000,Yankee Grey,Another Nine Minutes,3:10,2000-04-29,wk76,NaN
24088,2000,"Yearwood, Trisha",Real Live Woman,3:55,2000-04-01,wk76,NaN
24089,2000,Ying Yang Twins,Whistle While You Tw...,4:19,2000-03-18,wk76,NaN
24090,2000,Zombie Nation,Kernkraft 400,3:30,2000-09-02,wk76,NaN
24091,2000,matchbox twenty,Bent,4:12,2000-04-29,wk76,NaN

#### Another example

In [40]:
# Regligion & Income
pew = pd.read_csv('./datasets/pew.csv')

# Let's take a look
pew.head()

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116

In [43]:
# Melt all columns but religion
pew_long = pd.melt(pew,"religion")

# Let's take a look
pew_long.head()

             religion variable  value
0            Agnostic    <$10k     27
1             Atheist    <$10k     12
2            Buddhist    <$10k     27
3            Catholic    <$10k    418
4  Don’t know/refused    <$10k     15

In [44]:
# Select only columns where religion is Buddhist

bd_df = pew_long[ pew_long["religion"]=="Buddhist"]

# Let's take a look
bd_df

     religion            variable  value
2    Buddhist               <$10k     27
20   Buddhist             $10-20k     21
38   Buddhist             $20-30k     30
56   Buddhist             $30-40k     34
74   Buddhist             $40-50k     33
92   Buddhist             $50-75k     58
110  Buddhist            $75-100k     62
128  Buddhist           $100-150k     39
146  Buddhist               >150k     53
164  Buddhist  Don't know/refused     54

In [46]:
# Sum all the values
bd_df['value'].sum()

411

In [48]:
# A shorter way (but can be confusing)
pew_long[ pew_long["religion"]=="Buddhist"]['value'].sum()

411

### One Column Contain Multiple Values
The column name may tell too many things.

In [50]:
ebola = pd.read_csv('./datasets/country_timeseries.csv')

In [51]:
# Let's take a look at some selected rows
ebola.iloc[:5, [0,1,2,3,10,11]]

         Date  Day  Cases_Guinea  Cases_Liberia  Deaths_Guinea  Deaths_Liberia
0    1/5/2015  289        2776.0            NaN         1786.0             NaN
1    1/4/2015  288        2775.0            NaN         1781.0             NaN
2    1/3/2015  287        2769.0         8166.0         1767.0          3496.0
3    1/2/2015  286           NaN         8157.0            NaN          3496.0
4  12/31/2014  284        2730.0         8115.0         1739.0          3471.0

If we look at the column **Cases_Guinea**, we will see that the column it self is about number of cases in Guinea.

CASES , GUINEA

The dataset also has data of other countries. So, the column names sound like a varible.
Additional to the fact the column **Cases_Guinea** tells us that we have this Guinea (country) in our dataset, this column also tells us the number of cases. Number of cases also sounds like another variable (column).

In [53]:
ebola_long = pd.melt(ebola, id_vars=['Date', 'Day'])

In [54]:
ebola_long

            Date  Day      variable   value
0       1/5/2015  289  Cases_Guinea  2776.0
1       1/4/2015  288  Cases_Guinea  2775.0
2       1/3/2015  287  Cases_Guinea  2769.0
3       1/2/2015  286  Cases_Guinea     NaN
4     12/31/2014  284  Cases_Guinea  2730.0
...          ...  ...           ...     ...
1947   3/27/2014    5   Deaths_Mali     NaN
1948   3/26/2014    4   Deaths_Mali     NaN
1949   3/25/2014    3   Deaths_Mali     NaN
1950   3/24/2014    2   Deaths_Mali     NaN
1951   3/22/2014    0   Deaths_Mali     NaN

[1952 rows x 4 columns]

## Using STRING function to the whole column , .str.func()

The column **variable** holds string. We can use Python function to split it.

We will call split function, it will return a series.

That will be a series of a list.

The list will hold parts from the splitting process.

In [56]:
# split the string in each cell (field) in to a list of strings
# Use _ as a splot to split the string
variable_split = ebola_long.variable.str.split('_') # return a series

# Let's take a look
variable_split.head()

0    [Cases, Guinea]
1    [Cases, Guinea]
2    [Cases, Guinea]
3    [Cases, Guinea]
4    [Cases, Guinea]
Name: variable, dtype: object

In [57]:
# Type of this string operation shall be a series
type(variable_split)

pandas.core.series.Series

In [58]:
# Each element shall be a list
type(variable_split[0])

list

In [59]:
# The first element of the list the the first chuck before _
variable_split[0][0]

'Cases'

In [60]:
# The second part shall be the one after _
variable_split[0][1]

'Guinea'

In [66]:
# That's how we access any particular value.
# How about want to split that column into 2 columns

# Let's take a look again --> a series of lists
variable_split.head()

0    [Cases, Guinea]
1    [Cases, Guinea]
2    [Cases, Guinea]
3    [Cases, Guinea]
4    [Cases, Guinea]
Name: variable, dtype: object

In [69]:
# A series is like a column, we can call .str function on this series as well
#
# Let's call .str.get()
# 
# This function will extract elements from the string.
# A string is actually one from of a list
#
# .str.get(n) will extract only that element of the list out
#
status_values = variable_split.str.get(0)  # return a series of value before _
country_values = variable_split.str.get(1) # return a series of value after _

# Let's take a look at a series extracted from the first part
status_values

0        Cases
1        Cases
2        Cases
3        Cases
4        Cases
         ...
1947    Deaths
1948    Deaths
1949    Deaths
1950    Deaths
1951    Deaths
Name: variable, Length: 1952, dtype: object

In [71]:
# Let's take a look at a series extracted from the second part
country_values

0       Guinea
1       Guinea
2       Guinea
3       Guinea
4       Guinea
         ...
1947      Mali
1948      Mali
1949      Mali
1950      Mali
1951      Mali
Name: variable, Length: 1952, dtype: object

In [72]:
# Now, we add these two series as new columns to the data frame
ebola_long['status'] = status_values
ebola_long['country'] = country_values

In [80]:
ebola_long.iloc[[0,1,2,3,976,977,978]]

         Date  Day       variable   value  status country
0    1/5/2015  289   Cases_Guinea  2776.0   Cases  Guinea
1    1/4/2015  288   Cases_Guinea  2775.0   Cases  Guinea
2    1/3/2015  287   Cases_Guinea  2769.0   Cases  Guinea
3    1/2/2015  286   Cases_Guinea     NaN   Cases  Guinea
976  1/5/2015  289  Deaths_Guinea  1786.0  Deaths  Guinea
977  1/4/2015  288  Deaths_Guinea  1781.0  Deaths  Guinea
978  1/3/2015  287  Deaths_Guinea  1767.0  Deaths  Guinea

## SPLITTING a column of string into two columns (all together)

In [73]:
ebola_long.head(2)

       Date  Day      variable   value status country
0  1/5/2015  289  Cases_Guinea  2776.0  Cases  Guinea
1  1/4/2015  288  Cases_Guinea  2775.0  Cases  Guinea

In [77]:
# We put the knowledge above here into 3 lines
ser_of_list = ebola_long.variable.str.split('_')
ebola_long['new_col_1']=ser_of_list.str.get(0)
ebola_long['new_col_2']=ser_of_list.str.get(1)

#Let's take a look
ebola_long.head(2)

       Date  Day      variable   value status country new_col_1 new_col_2
0  1/5/2015  289  Cases_Guinea  2776.0  Cases  Guinea     Cases    Guinea
1  1/4/2015  288  Cases_Guinea  2775.0  Cases  Guinea     Cases    Guinea

## 2. Pivot Data
We can think about pivot data as the reverse of melt.
![pivot1](./assets/pivot1.png)
![pivot2](./assets/pivot2.png)

In [79]:
weather = pd.read_csv('./datasets/weather.csv')

In [80]:
# Let's take a look
weather.head()

,id,year,month,element,d1,d2,d3,d4,d5,d6,...,d22,d23,d24,d25,d26,d27,d28,d29,d30,d31
0,MX17004,2010,1,tmax,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.8,NaN
1,MX17004,2010,1,tmin,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.5,NaN
2,MX17004,2010,2,tmax,NaN,27.3,24.1,NaN,NaN,NaN,...,NaN,29.9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,MX17004,2010,2,tmin,NaN,14.4,14.4,NaN,NaN,NaN,...,NaN,10.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,MX17004,2010,3,tmax,NaN,NaN,NaN,NaN,32.1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [82]:
# Melt them
weather_melt = pd.melt(weather, id_vars=['id','year','month','element'], var_name ='day', value_name='temp')

# Let's take a look
weather_melt.iloc[638:645]

          id  year  month element  day  temp
638  MX17004  2010      1    tmax  d30  27.8
639  MX17004  2010      1    tmin  d30  14.5
640  MX17004  2010      2    tmax  d30   NaN
641  MX17004  2010      2    tmin  d30   NaN
642  MX17004  2010      3    tmax  d30   NaN
643  MX17004  2010      3    tmin  d30   NaN
644  MX17004  2010      4    tmax  d30   NaN

In [86]:
# PIVOT : elemtn & temp
#       : element to be a new column label
#       : temp will be come a value in that column

weather_tidy = weather_melt.pivot_table(index=['id','year','month','day'],columns='element',values='temp').reset_index()

# Let's take a look
weather_tidy.head()

element       id  year  month  day  tmax  tmin
0        MX17004  2010      1  d30  27.8  14.5
1        MX17004  2010      2  d11  29.7  13.4
2        MX17004  2010      2   d2  27.3  14.4
3        MX17004  2010      2  d23  29.9  10.7
4        MX17004  2010      2   d3  24.1  14.4

In [89]:
# Now, we can calculate the delta easily
weather_tidy['delta']=weather_tidy['tmax']-weather_tidy['tmin']

# Let's take a look
weather_tidy.head()

element       id  year  month  day  tmax  tmin  delta
0        MX17004  2010      1  d30  27.8  14.5   13.3
1        MX17004  2010      2  d11  29.7  13.4   16.3
2        MX17004  2010      2   d2  27.3  14.4   12.9
3        MX17004  2010      2  d23  29.9  10.7   19.2
4        MX17004  2010      2   d3  24.1  14.4    9.7